astrobin_apps_payments/tests/data/premium_monthly_first_order/customer.subscription.updated.json

{
  "id": "evt_1NBuLFC0tT6bv7HdPeHYWE7h",
  "object": "event",
  "api_version": "2020-08-27",
  "created": 1685083296,
  "data": {
    "object": {
      "id": "sub_1NBuLCC0tT6bv7HdsEJE5BMx",
      "object": "subscription",
      "application": null,
      "application_fee_percent": null,
      "automatic_tax": {
        "enabled": false
      },
      "billing_cycle_anchor": STRIPE_EVENT_START_TIMESTAMP,
      "billing_thresholds": null,
      "cancel_at": null,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "cancellation_details": {
        "comment": null,
        "feedback": null,
        "reason": null
      },
      "collection_method": "charge_automatically",
      "created": STRIPE_EVENT_START_TIMESTAMP,
      "currency": "usd",
      "current_period_end": STRIPE_EVENT_END_TIMESTAMP,
      "current_period_start": STRIPE_EVENT_START_TIMESTAMP,
      "customer": "STRIPE_CUSTOMER_ID",
      "days_until_due": null,
      "default_payment_method": "pm_1NBuLCC0tT6bv7HdnDgBsBFz",
      "default_source": null,
      "default_tax_rates": [
      ],
      "description": null,
      "discount": null,
      "ended_at": null,
      "items": {
        "object": "list",
        "data": [
          {
            "id": "si_Nxq1aYTvbM19If",
            "object": "subscription_item",
            "billing_thresholds": null,
            "created": STRIPE_EVENT_START_TIMESTAMP,
            "metadata": {
            },
            "plan": {
              "id": "STRIPE_PRICE_PREMIUM_MONTHLY_TIER_1_TEST",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 2000,
              "amount_decimal": "2000",
              "billing_scheme": "per_unit",
              "created": STRIPE_EVENT_START_TIMESTAMP,
              "currency": "chf",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {
              },
              "nickname": "AstroBin Premium 1 month recurring (tier 1)",
              "product": "STRIPE_PRODUCT_PREMIUM_TEST",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "price": {
              "id": "STRIPE_PRICE_PREMIUM_MONTHLY_TIER_1_TEST",
              "object": "price",
              "active": true,
              "billing_scheme": "per_unit",
              "created": STRIPE_EVENT_START_TIMESTAMP,
              "currency": "chf",
              "custom_unit_amount": null,
              "livemode": false,
              "lookup_key": null,
              "metadata": {
              },
              "nickname": "AstroBin Premium 1 month recurring (tier 1)",
              "product": "STRIPE_PRODUCT_PREMIUM_TEST",
              "recurring": {
                "aggregate_usage": null,
                "interval": "month",
                "interval_count": 1,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tax_behavior": "exclusive",
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 2000,
              "unit_amount_decimal": "2000"
            },
            "quantity": 1,
            "subscription": "sub_1NBuLCC0tT6bv7HdsEJE5BMx",
            "tax_rates": [
            ]
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_1NBuLCC0tT6bv7HdsEJE5BMx"
      },
      "latest_invoice": "in_1NBuLCC0tT6bv7Hd2Hnagnce",
      "livemode": false,
      "metadata": {
      },
      "next_pending_invoice_item_invoice": null,
      "on_behalf_of": null,
      "pause_collection": null,
      "payment_settings": {
        "payment_method_options": null,
        "payment_method_types": null,
        "save_default_payment_method": "off"
      },
      "pending_invoice_item_interval": null,
      "pending_setup_intent": null,
      "pending_update": null,
      "plan": {
        "id": "STRIPE_PRICE_PREMIUM_MONTHLY_TIER_1_TEST",
        "object": "plan",
        "active": true,
        "aggregate_usage": null,
        "amount": 2000,
        "amount_decimal": "2000",
        "billing_scheme": "per_unit",
        "created": STRIPE_EVENT_START_TIMESTAMP,
        "currency": "chf",
        "interval": "month",
        "interval_count": 1,
        "livemode": false,
        "metadata": {
        },
        "nickname": "AstroBin Premium 1 month recurring (tier 1)",
        "product": "STRIPE_PRODUCT_PREMIUM_TEST",
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
      },
      "quantity": 1,
      "schedule": null,
      "start_date": STRIPE_EVENT_START_TIMESTAMP,
      "status": "active",
      "test_clock": null,
      "transfer_data": null,
      "trial_end": null,
      "trial_settings": {
        "end_behavior": {
          "missing_payment_method": "create_invoice"
        }
      },
      "trial_start": null
    },
    "previous_attributes": {
      "default_payment_method": null,
      "status": "incomplete"
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": "req_ZpcYMVo3n1NdDl",
    "idempotency_key": "23060f11-1a46-4544-aa39-09982ea04d8b"
  },
  "type": "customer.subscription.updated"
}
