astrobin_apps_payments/tests/data/premium_once_first_order/payment_intent.succeeded.json

{
  "id": "evt_3NByAGC0tT6bv7Hd0DMQzcVY",
  "object": "event",
  "api_version": "2020-08-27",
  "created": 1685098024,
  "data": {
    "object": {
      "id": "pi_3NByAGC0tT6bv7Hd0rdC07q5",
      "object": "payment_intent",
      "amount": 2100,
      "amount_capturable": 0,
      "amount_details": {
        "tip": {
        }
      },
      "amount_received": 2100,
      "application": null,
      "application_fee_amount": null,
      "automatic_payment_methods": null,
      "canceled_at": null,
      "cancellation_reason": null,
      "capture_method": "automatic",
      "charges": {
        "object": "list",
        "data": [
          {
            "id": "ch_3NByAGC0tT6bv7Hd0NoybNP4",
            "object": "charge",
            "amount": 2100,
            "amount_captured": 2100,
            "amount_refunded": 0,
            "application": null,
            "application_fee": null,
            "application_fee_amount": null,
            "balance_transaction": "txn_3NByAGC0tT6bv7Hd0zm8zfEG",
            "billing_details": {
              "address": {
                "city": null,
                "country": "US",
                "line1": null,
                "line2": null,
                "postal_code": "12345",
                "state": null
              },
              "email": "astrobin@astrobin.com",
              "name": "Test User",
              "phone": null
            },
            "calculated_statement_descriptor": "ASTROBIN",
            "captured": true,
            "created": 1685098023,
            "currency": "usd",
            "customer": "STRIPE_CUSTOMER_ID",
            "description": null,
            "destination": null,
            "dispute": null,
            "disputed": false,
            "failure_balance_transaction": null,
            "failure_code": null,
            "failure_message": null,
            "fraud_details": {
            },
            "invoice": null,
            "livemode": false,
            "metadata": {
            },
            "on_behalf_of": null,
            "order": null,
            "outcome": {
              "network_status": "approved_by_network",
              "reason": null,
              "risk_level": "normal",
              "risk_score": 49,
              "seller_message": "Payment complete.",
              "type": "authorized"
            },
            "paid": true,
            "payment_intent": "pi_3NByAGC0tT6bv7Hd0rdC07q5",
            "payment_method": "pm_1NByAkC0tT6bv7HdyWPGty79",
            "payment_method_details": {
              "card": {
                "brand": "visa",
                "checks": {
                  "address_line1_check": null,
                  "address_postal_code_check": "pass",
                  "cvc_check": "pass"
                },
                "country": "US",
                "exp_month": 12,
                "exp_year": 2073,
                "fingerprint": "Xi05hB6PSTV4ACeF",
                "funding": "credit",
                "installments": null,
                "last4": "4242",
                "mandate": null,
                "network": "visa",
                "network_token": {
                  "used": false
                },
                "three_d_secure": null,
                "wallet": null
              },
              "type": "card"
            },
            "receipt_email": "astrobin@astrobin.com",
            "receipt_number": null,
            "receipt_url": "https://pay.stripe.com/receipts/payment/CAcaFwoVYWNjdF8xQlc4ajNDMHRUNmJ2N0hkKKicwqMGMgazoGOHkMc6LBbnAC2Bzl0gdRkYXO_OI6q6c0DlLC2dwRf9cmG0dS5g_r_B5eDtXjPi86FG",
            "refunded": false,
            "refunds": {
              "object": "list",
              "data": [
              ],
              "has_more": false,
              "total_count": 0,
              "url": "/v1/charges/ch_3NByAGC0tT6bv7Hd0NoybNP4/refunds"
            },
            "review": null,
            "shipping": null,
            "source": null,
            "source_transfer": null,
            "statement_descriptor": null,
            "statement_descriptor_suffix": null,
            "status": "succeeded",
            "transfer_data": null,
            "transfer_group": null
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/charges?payment_intent=pi_3NByAGC0tT6bv7Hd0rdC07q5"
      },
      "client_secret": "pi_3NByAGC0tT6bv7Hd0rdC07q5_secret_L6jDSKDv5zipwPgDUL40jz92n",
      "confirmation_method": "automatic",
      "created": 1685097992,
      "currency": "usd",
      "customer": "STRIPE_CUSTOMER_ID",
      "description": null,
      "invoice": null,
      "last_payment_error": null,
      "latest_charge": "ch_3NByAGC0tT6bv7Hd0NoybNP4",
      "livemode": false,
      "metadata": {
      },
      "next_action": null,
      "on_behalf_of": null,
      "payment_method": "pm_1NByAkC0tT6bv7HdyWPGty79",
      "payment_method_options": {
        "card": {
          "installments": null,
          "mandate_options": null,
          "network": null,
          "request_three_d_secure": "automatic"
        }
      },
      "payment_method_types": [
        "card"
      ],
      "processing": null,
      "receipt_email": "astrobin@astrobin.com",
      "review": null,
      "setup_future_usage": null,
      "shipping": null,
      "source": null,
      "statement_descriptor": null,
      "statement_descriptor_suffix": null,
      "status": "succeeded",
      "transfer_data": null,
      "transfer_group": null
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": "req_KkpoeitZeyWSd5",
    "idempotency_key": "42664254-c3a8-4fb9-8f49-764798c984a4"
  },
  "type": "payment_intent.succeeded"
}
